app/controllers/v1/providers_controller.rb

  def create
    provider = Provider.new(
      first_name: params[:first_name].downcase.capitalize,
      last_name: params[:last_name].downcase.capitalize,
      phone_number: params[:phone_number],
      zip: params[:zip],
      provider_type_id: params[:provider_type_id].to_i,
      email: params[:email].downcase,
      password: params[:password],
      password_confirmation: params[:password_confirmation]
    )

    if provider.save
---
INSERT INTO "providers" ("email", "password_digest", "first_name", "last_name", "phone_number", "zip", "provider_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"