app/controllers/v1/services_controller.rb

SELECT "services".* FROM "services"
---
  def index
    services = Service.all