app/controllers/provider_token_controller.rb

  def create
    email = request.params["auth"] && request.params["auth"]["email"]
    password = request.params["auth"] && request.params["auth"]["password"]
    provider = Provider.find_by(email: email)
---
SELECT  "providers".* FROM "providers" WHERE "providers"."email" = $1 LIMIT $2  [["email", "frank.zack@gmail.com"], ["LIMIT", 1]]